# Statistics

In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.read_csv("income.csv", names=["name", "income"], skiprows=[0])
df

  name    income
0    A      5000
1    B      6000
2    C      4000
3    D      7500
4    E      8000
5    F      7000
6    G  10000000

In [3]:
df.describe()

             income
count  7.000000e+00
mean   1.433929e+06
std    3.777283e+06
min    4.000000e+03
25%    5.500000e+03
50%    7.000000e+03
75%    7.750000e+03
max    1.000000e+07

## Percentile

In [4]:
df.income.quantile(0.75)

7750.0

In [5]:
df.income.quantile(0.75, interpolation = "lower")

7500

In [6]:
df.income.quantile(0.75, interpolation = "higher")

8000

In [7]:
df.income.quantile(1)

10000000.0

In [8]:
percentile_99 = df.income.quantile(0.99)
percentile_99

9400479.999999994

In [9]:
# remove outlier
df_no_outlier = df[df.income <= percentile_99]
df_no_outlier

  name  income
0    A    5000
1    B    6000
2    C    4000
3    D    7500
4    E    8000
5    F    7000

## Mean, Median & Mode

In [10]:
# work with missing value
df

  name    income
0    A      5000
1    B      6000
2    C      4000
3    D      7500
4    E      8000
5    F      7000
6    G  10000000

In [11]:
df["income"][3] = np.NaN

C:\Users\ASUS\AppData\Local\Temp\ipykernel_10760\783890398.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df["income"][3] = np.NaN

In [12]:
df

  name      income
0    A      5000.0
1    B      6000.0
2    C      4000.0
3    D         NaN
4    E      8000.0
5    F      7000.0
6    G  10000000.0

In [13]:
df.income.mean()

1671666.6666666667

In [14]:
df_new = df.fillna(df.income.median())
df_new

  name      income
0    A      5000.0
1    B      6000.0
2    C      4000.0
3    D      6500.0
4    E      8000.0
5    F      7000.0
6    G  10000000.0